In [262]:
import pandas as pd
import numpy as np
from functools import reduce
import time

In [271]:
df=pd.read_csv('/Users/olegsiskin/Desktop/titanic/test.csv')
test_df=pd.read_csv('/Users/olegsiskin/Desktop/titanic/test.csv')
test_df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [272]:
def sex_decoding(s):
    if s=='male':
        return 0
    else:
        return 1

In [273]:
start_time=time.time()
for i in test_df.index.tolist():
    test_df.at[i,'Sex']=sex_decoding(test_df.at[i,'Sex'])
print("--- %s seconds ---" % (time.time() - start_time))
test_df

--- 0.016546010971069336 seconds ---

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",1,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,C

In [274]:
start_time=time.time()
df.Sex=df.Sex.map(lambda x:sex_decoding(x))
print("--- %s seconds ---" % (time.time() - start_time))
df

--- 0.001600027084350586 seconds ---

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",1,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,C

In [285]:
start_time=time.time()
df1=list(filter(lambda  x:df.iloc[x].Sex==0,df.index.to_list()))
print("--- %s seconds ---" % (time.time() - start_time))
df1[0:5]

--- 0.09414291381835938 seconds ---

[0, 2, 3, 5, 7]

In [282]:
test_df1=[]
start_time=time.time()
for i in test_df.index.to_list():
    if test_df.iloc[i].Sex==0:
        test_df1.append(i)
print("--- %s seconds ---" % (time.time() - start_time))
test_df1[0:5]

--- 0.10062217712402344 seconds ---

[0, 2, 3, 5, 7]

In [269]:
df2=df.iloc[df1].Fare.dropna()
start_time=time.time()
sm=reduce(lambda x,y:x+y,df2)
print("--- %s seconds ---" % (time.time() - start_time))
print(sm)

--- 0.00015616416931152344 seconds ---
7294.887400000003

In [270]:
test_df2=test_df.iloc[test_df1].Fare.dropna()
start_time=time.time()
test_sum=0
for i in test_df2.index.tolist():
    test_sum+=test_df2[i]
print("--- %s seconds ---" % (time.time() - start_time))
print(test_sum)

--- 0.0010020732879638672 seconds ---
7294.887400000003